Project_3/task5(stats)/ab_results_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /predict
Document Length:        75 bytes

Concurrency Level:      100
Time taken for tests:   1.711 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      219000 bytes
Total body sent:        167000
HTML transferred:       75000 bytes
Requests per second:    584.45 [#/sec] (mean)
Time per request:       171.100 [ms] (mean)
Time per request:       1.711 [ms] (mean, across all concurrent requests)
Transfer rate:          125.00 [Kbytes/sec] received
                        95.32 kb/s sent
                        220.31 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   1.8      3      10
Processing:   127  155   2.8    156     166
Waiting:      124  148   3.4    148     156
Total:        127  158   3.8    158     168

Percentage of the requests served within a certain time (ms)
  50%    158
  66%    159
  75%    159
  80%    160
  90%    168
  95%    168
  98%    168
  99%    168
 100%    168 (longest request)