Project_3/task5(stats)/ab_results_50.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /predict
Document Length:        75 bytes

Concurrency Level:      50
Time taken for tests:   1.664 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      109500 bytes
Total body sent:        83500
HTML transferred:       37500 bytes
Requests per second:    300.41 [#/sec] (mean)
Time per request:       166.439 [ms] (mean)
Time per request:       3.329 [ms] (mean, across all concurrent requests)
Transfer rate:          64.25 [Kbytes/sec] received
                        48.99 kb/s sent
                        113.24 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   0.8      4       4
Processing:   131  137   6.9    137     267
Waiting:      125  132   7.0    132     266
Total:        133  140   6.9    140     267
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%    140
  66%    140
  75%    140
  80%    141
  90%    149
  95%    149
  98%    149
  99%    149
 100%    267 (longest request)